IDEA StatiCa Open Model
ColumnData Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Column data base
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.ColumnData
 IdeaRS.OpenModel.Concrete.ColumnDataEc2
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public abstract class ColumnData
Public MustInherit Class ColumnData
public ref class ColumnData abstract
The ColumnData type exposes the following members.
Constructors
Name | Description
ColumnData
 Constructor
Top
Properties
Name | Description
CalculateY
 Gets an indication, whether imperfections and second order have to be performed perpendicular to the y axis.
CalculateZ
 Gets an indication, whether imperfections and second order have to be performed perpendicular to the z axis.
EffectiveLength
 Gets or sets type of input effective length
FemL0Y
 effective length calculated in FEM for Y direction
FemL0Z
 effective length calculated in FEM for Z direction
FemLenghtFromFlexibleSupport
 true if FEM length were calculated from flexible supports
ImperfectionDirection
 Gets or sets the direction of imperfection.
ImperfectionsInput
 Indicates, whether use user values or calculate effect of imperfections.
L
 Gets or sets the system length of column.
L0Y
 Gets or sets the user defined effective length of column for Y direction. If is not defined, the must be valid support data.
L0Z
 Gets or sets the user defined effective length of column for Z direction.
SecondOrderEffectInput
 Indicates, whether use user values or calculate 2'nd order effect.
SupportBottomY
 Gets or sets the end support. Not necessary if effective lengths are defined.
SupportBottomZ
 Gets or sets the end support. Not necessary if effective lengths are defined.
SupportTopY
 Gets or sets the end support. Not necessary if effective lengths are defined.
SupportTopZ
 Gets or sets the end support. Not necessary if effective lengths are defined.
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace